import React, { useState } from "react";
import { FaPlus, FaMinus, FaTooth } from "react-icons/fa";

const faqs = [
  { q: "ليه سناني بتصفر رغم إني بغسلها؟", a: " السبب غالبًا من العادات (شاي، قهوة، تدخين)، أو من طبيعة ميناء الأسنان اللي بتكون أغمق عند بعض الناس. الحل: تنظيف جير وتلميع، ولو محتاج درجة أعلى ممكن تبييض." },
  { q: "إيه أحسن معجون أستخدمه؟", a: " مفيش معجون واحد أحسن للكل، الأهم يكون فيه فلورايد مكافح للتسوس. لو عندك مشكلة معينة (حساسية – تبييض – لثة) فيه أنواع مخصوصة بنحددها حسب حالتك.." },
  { q: "ليه الخدمات عندكو اسعارها غالية كدا؟", a: "في مركز الصفوة بنحرص إن الخدمة اللي بنقدمها تبقى بأعلى جودة وأمان. وعشان كدا بنستخدم خامات وأدوات أصلية ومعقمة 100%. وبنضمنلك إن العلاج اللي بيتعمل هنا معمول بطريقة علمية صحيحة عشان يعيش معاك أطول فترة ممكنة..يعني حضرتك مش بتدفع في حشوة أو تركيبة النهارده بس، إنت بتستثمر في راحة وصحة فمك على المدى الطويل.." },
  { q: "هل فيه خطورة من بنج الأسنان", a: "معظم الناس بياخدوا البنج الموضعي بأمان تام. المشاكل بتحصل بس عند اللي عندهم حساسية معينة أو مشاكل قلبية خطيرة، وعشان كده دايمًا بنسأل على التاريخ المرضي كويس جداً لكل مريض داخل العيادة." },
  { q: "ليه لازم أعمل تنظيف جير كل فترة؟", a: "الجير بيتكون من ترسيب الأملاح والبكتيريا على الأسنان، ومهما فرّشت مش بيتشال بالفرشاة. تراكمه بيعمل التهاب لثة ورائحة مش كويسة، وعشان كده لازم يتشال كل 6 شهور – سنة.." },
  { q: "ما هو أفضل عمر لبدء تقويم الأسنان؟", a: "أفضل عمر بين 10 و14 سنة، لكن يمكن في أي عمر حسب الحالة." },
  { q: "أعرف منين إني محتاج تقويم ؟", a: " لو لاحظت أي مشكلة في انتظام الأسنان أو في العضة. أشهر العلامات:    1️⃣ الأسنان مزدحمة فوق بعض أو في فراغات كبيرة بينهم.  2️⃣ العضة مش مظبوطة (الأسنان العلوية مغطيّة زيادة على السفلية – أو العكس الأسنان السفلية طالعة قدام).  3️⃣ الأسنان مش راكبة صح وبتعمل صعوبة في المضغ أو نطق بعض الحروف. 4️⃣  في مشاكل في شكل الابتسامة أو المظهر العام للأسنان.. طبعًا القرار النهائي بيكون بعد الفحص وفي الغالب بنحتاج أشعة بانوراما أو صور خاصة بالتقويم عشان نحدد الخطة الأنسب." },
  { q: "هل زراعة الأسنان والتركيبات تدوم مدي الحياة ؟ وهل بتبقا زي السن الطبيعي ؟", a: "لتركيبات والزراعة بتعوض وظيفة وجمال السن بنسبة كبيرة جدًا، لكن طبعًا مش 100% زي خلقة ربنا الطبيعية. ولكن عندنا في مركز الصفوة ومع المتابعة الجيدة بتكون قريبة جدًا من الطبيعي. مع العناية الجيدة يمكن أن تدوم أكثر من 20 عامًاا" },
  { q: "هل الحشو أو حشو العصب مؤلمين؟", a: "لا، كل الإجراءات بتتم تحت تأثير التخدير الموضعي, وبمركز الصفوة نضمن لك الراحة التامة أثناء جميع مراحل العلاج." },
  { q: "هو الخلع مؤذي أو خطر؟", a: " الخلع إجراء آمن جدًا لما يتعمل صح وبإحترافية. ممكن يكون في شوية ورم بسيط بعده، وده طبيعي. أهم حاجة تتبع تعليمات ما بعد الخلع عشان يحصل التئام كويس.." },
  { q: "هل خلع ضروس العقل ضروري ؟", a: "✅ لو ضرس العقل طالع في مكانه الطبيعي، نضيف ومش عامل أي مشكلة يبقا مفيش داعي لخلعه. ❌ لكن لو مطمور (جزئي أو كلي) أو مائل وبيضغط على الضروس اللي جنبه، أو بيعمل التهابات متكررة في اللثة، أو تسوس صعب يتعالج يبقا هنا الأفضل يتخلع قبل ما يسبب مشاكل أكبر.." },
  { q: "لو انا عندي مشاكل في مفصل الفك ؟ اكشف عندكم ولا فين ؟", a: "مشاكل مفصل الفك (TMJ) بتبان في صورة طقطقة، ألم قدام الأذن، صعوبة أو ألم مع الفتح والأكل لخطوة الأولى دايمًا تبدأ عند دكتور الأسنان، لأنه هو اللي بيشخص الحالة ويحدد إذا كان محتاج علاج بسيط (زي جهاز بسيط يتلبس بالليل أو علاج ا دوائي وتعليمات مخصوصة لكل مريض)" },
  { q: " لو انا مش عايز ازرع .. هل التركيبات المتحركة حل كويس ؟", a: "التركيبات المتحركة ممكن تكون حل ممتاز لتعويض الأسنان المفقودة لو اتعملت  بشكل احترافي وبخامات حديثة. خصوصًا لو الزرع مش مناسب لحالتك أو مش عايز تعمله.  بس لازم تعرف إن: - التركيبات المتحركة بتديك وظيفة وشكل كويس، لكنها أقل ثبات وراحة من الزراعة  أو التركيبات الثابتة وبتحتاج وقت عشان تتأقلم عليها.   بتحتاج منك متابعة وتنضيف مستمر بشكل يومي.." },
];

export default function FAQSection() {
  const [openId, setOpenId] = useState(null);

  const toggleFAQ = (id) => {
    setOpenId(openId === id ? null : id);
  };

  return (
    <section className="bg-gradient-to-b from-[#fefefe] to-[#f5f5f52f] py-16 px-4 md:px-10">
      <h2 className="text-2xl md:text-3xl font-bold text-center text-[#ED1C24] mb-10 flex items-center justify-center gap-3">
        <FaTooth className="text-[#1A237E]" />
        الأسئلة الشائعة
      </h2>

      <div className="flex flex-col gap-6 max-w-4xl mx-auto">
        {faqs.map((faq, index) => (
          <div
            key={index}
            className="bg-white shadow-lg rounded-xl overflow-hidden border border-gray-200 w-full"
          >
            <button
              onClick={() => toggleFAQ(index)}
              className="w-full flex justify-between items-center px-6 py-4 text-right text-lg font-semibold text-gray-800 hover:bg-gray-50 transition"
            >
              {faq.q}
              {openId === index ? (
                <FaMinus className="text-[#ED1C24]" />
              ) : (
                <FaPlus className="text-[#1A237E]" />
              )}
            </button>

<div
  className={`px-6 overflow-y-scroll bg-gray-50 border-t border-gray-200 text-gray-600 leading-relaxed transition-all duration-500 ease-in-out  ${
    openId === index
      ? "max-h-40 py-4 opacity-100"
      : "max-h-0 opacity-0 py-0"
  }`}
>
  {faq.a}
</div>
          </div>
        ))}
      </div>
    </section>
  );
}
